# StructuralSectionUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionUtils Class
Members See Also
---
This class provides utilities related to Structural Section Properties.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static class StructuralSectionUtils
```

Visual Basic
---
```text
Public NotInheritable Class StructuralSectionUtils
```

Visual C++
---
```text
public ref class StructuralSectionUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionUtils
# See Also
StructuralSectionUtils Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace